LeftDomain/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
    // Outer domain only boundaries
    left_inlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }

    "left_bottom|left_top|left_front|left_back"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    // Shared Outer-inner boundaries

    left_outlet // All these BC's will need to be coupled BC's
    {
        //type            ????;
        //value           uniform (0 0 0);
    }
}


// ************************************************************************* //
